[
  {
    "boxId": 100,
    "title": "Demo Note",
    "notes": [
      {
        "noteId": 1,
        "type": "heading",
        "text": "Welcome to the demmo Note"
      },
      {
        "noteId": 10,
        "type": "heading",
        "text": "These Items are Headers"
      },
      {
        "noteId": 2,
        "type": "text",
        "text": "Items like these are text items. They allow a user to input their information directly into the page."
      },
      {
        "noteId": 4,
        "type": "heading",
        "text": "Adding Headers and Text"
      },
      {
        "noteId": 5,
        "type": "text",
        "text": "Adding headers and text can be done at the bottom of the screen. By selecting header or text you will be able to input and save a new text which as of right now will be stored in your local storage."
      },
      {
        "noteId": 6,
        "type": "heading",
        "text": "Editing an Item"
      },
      {
        "noteId": 7,
        "type": "text",
        "text": "Every time your mouse passes over an item rendered in the box your current item will be highlighted. When clicked the use will be given the opportunity to edit their item. If text is changed and they try to close the editor without saving they will be issued a warning to continue. Common practice will be to save before exiting in order to avoid accidentally not saving information that you have input. The title can be edited but not deleted."
      },
      {
        "noteId": 8,
        "type": "heading",
        "text": "Future Features"
      },
      {
        "noteId": 9,
        "type": "text",
        "text": "1. Numbered/bulleted lists should be added"
      },
      {
        "noteId": 11,
        "type": "text",
        "text": "2. More reliable way of saving user information\nRight now all information is stored in the browser and can be easily/mistakenly deleted"
      },
      {
        "noteId": 12,
        "type": "text",
        "text": "3. Customizable fonts colors and backgrounds"
      },
      {
        "noteId": 13,
        "type": "text",
        "text": "4. A way to export Notes created into pdfs so that they can be easily transfered to word documents or google docs type apps"
      },
      {
        "noteId": 14,
        "type": "text",
        "text": "5. More stops to prevent accidental deletion of information"
      }
    ]
  }
]
