[
  {
    "boxId": 100,
    "title": "Demo Note",
    "notes": [
      {
        "noteId": 1,
        "type": "heading",
        "text": "Welcome to the demmo Note"
      },
      {
        "noteId": 10,
        "type": "heading",
        "text": "These Items are Headers"
      },
      {
        "noteId": 921,
        "type": "text",
        "text": "1"
      },
      {
        "noteId": 2,
        "type": "text",
        "text": "Items like these are text\n\n\n\n\n\n items. They allow a user to input their information directly into the page so that it is easy on the eyes and looks complete."
      },
      {
        "noteId": 4,
        "type": "heading",
        "text": "Adding Headers and Text"
      },
      {
        "noteId": 5,
        "type": "text",
        "text": "Adding headers and text can be done at the bottom of the screen. By selecting header or text you will be able to input and save a new text which as of right now will be stored in your local storage."
      },
      {
        "noteId": 6,
        "type": "heading",
        "text": "Editing an Item"
      },
      {
        "noteId": 7,
        "type": "text",
        "text": "Every time your mouse passes over an item rendered in the box a black outline will appear indicating which item you are currently on. When clicked the use will be given the opportunity to edit their item. If text is changed and they try to close the editor without saving they will be issued a warning to continue. Common practice will be to save before exiting in order to avoid accidentally not saving information that you have input. The title can be edited but not deleted."
      },
      {
        "noteId": 8,
        "type": "heading",
        "text": "The Focus Please Read"
      },
      {
        "noteId": 9,
        "type": "text",
        "text": "It is natural for a beta tester to want to give their own input into what they think that app should look like or what features should be added, but there are a lot of features that are on the way and your ideas won't be considered until the app is in its more complete form, so thank you and please save all ideas for a later date. :* I also did not proof read these messages so any advice on these sentences hold little merit."
      }
    ]
  }
]
